# FlowDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryConnectorData..::..FlowDirection Property
PipeFittingAndAccessoryConnectorData Class See Also
---
The flow direction of this connector, In or Out.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FlowDirectionType FlowDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FlowDirection As FlowDirectionType
	Get
```

Visual C++
---
```text
public:
property FlowDirectionType FlowDirection {
	FlowDirectionType get ();
}
```

# See Also
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace